package com.example.nanda.newagri.Agriculture;

/**
 * Created by Nanda on 4/3/2018.
 */

public class Ecological_RelationShip {

    public String  பழக்காடி() {
        String array1="வாழைப்பழம், அரசாணி, பப்பாளி, நாட்டுக் கோழி முட்டை ( ஓடை நீக்கிய ), சர்க்கரை (சர்க்கரை, இரசாயனம் கலக்காததாக இருக்க வேண்டும்). பழங்கள் அனைத்தும் நன்கு கனிந்து இருத்தல் நலம் ( பழக்கடைகளிருந்து கழித்த பழங்களை பெற்றும் பயன்படுத்தலாம்). இவற்றை நன்றாகக் கலக்கி 25 நாட்கள் மூடி வைத்தால் தயாராகிவிடும், இதனை 3 மாதம் வரை வைத்துப் பயன்படுத்தலாம். ஸ்பிரேயரில் 300 மி.லி ஒரு டேங்கிற்கு ( 10 லிட்டர் தண்ணீர் ) கொடுக்கலாம்.";
        return array1;
    }
    public String  மண்புழுஉரம்() {
        String array1="தயாரிப்பு முறை\n" +
                "☘மண்புழு உரம் உற்பத்தி செய்ய நிழலுடன் அதிகளவு ஈரப்பதம் உள்ள குளிர்ச்சியான பகுதியாக இருக்க வேண்டும்.\n" +
                "☘திறந்த வெளியில் உற்பத்தி செய்வதாக இருந்தால், நிழலான இடத்தை தேர்ந்தெடுக்கவும்.\n" +
                "வெயில் மற்றும் மழையிலிருந்து பாதுகாப்பதற்கு, தென்னைக்கீற்றுக் கூரையை பயன்படுத்தலாம்.\n" +
                "☘சிமெண்ட் தொட்டி கட்டுவதற்கு அதன் உயரம் 3 அடியாகவும் அகலம் 3 அடியாகவும் நீளம் உங்கள் விருப்பமாக அமைத்து கொள்ளலாம்.\n" +
                "☘மண்புழு உரம் உற்பத்திகான படுக்கை. தென்னை நார்கஅழகிரி கழிவு அல்லது கரும்புத் தோகைகளை மண்புழு உரம் உற்பத்திக்கான படுக்கையின் அடிப்பாகத்தில் 6 செ.மீ . உயரத்திற்கு பரப்ப வேண்டும். இதற்கு மேல் தண்ணீரைத் தெளிக்க வேண்டும்.\n" +
                "☘இப்போது நாம் பாதி மக்கிய கால்நடைக் கழிவுடன் இலை மக்குக் கழிவு மற்றும் காய்கறி மக்கு போன்ற கழிவுகளை படுக்கையில் நிரப்ப வேண்டும். ஈரப்பதம் 65% இருக்கு வேண்டும். நாம் தேர்ந்தெடுக்கப்பட்ட மண்புழுவை சமமாக பரப்ப வேண்டும். ஒரு மீட்டர் நீளம், ஒரு மீட்டர் அகலம், ஒரு மீட்டர் உயரத்திற்கு ஒரு கிலோ மண்புழு தேவைப்படுகிறது.\n" +
                "☘நாம் தினமும் தண்ணீர் தெளிப்பது அவசியம். இதனுடைய ஈரப்பதம் 65% இருக்கு வேண்டும். தண்ணீரை ஊற்றக்கூடாது, தெளிக்க வேண்டும் மேலும் அறுவடைக்கு முன்னதாக தண்ணீர் தெளிப்பதை நிறுத்தி விட வேண்டும்.\n" +
                "☘இப்போது நாம் மண்புழு உரப் படுக்கையில் மேல் உள்ள மண்புழுக் கழிவினை மட்டும் அறுவடை செய்ய வேண்டும். இந்த அறுவடை 5 நாட்களுக்கு ஒருமுறை செய்ய வேண்டும். எப்போதும் நாம் கையால்தான் புழுகழிவினை சேகரித்து நிழலில் குவித்து வைக்க வேண்டும் அல்லது இருட்டான அறையில் 45% ஈரப்பதத்தில் சூரிய ஒளி படாதவாறு வைக்க வேண்டும். திறந்த வெளியில் உரத்தை சேமிக்கும்போது தண்ணீர் தெளித்து ஈரப்பதத்தை காக்க வேண்டும்.இதனால் இந்த மண்புழு உரத்தில் உள்ள நுண்ணுயிர்கள் அழிவதைத் தடுக்கலாம்.\n" +
                "☘ *ஊட்டமேற்றிய மண்புழு உரம்*\n" +
                "பாஸ்போ பேக்டீரியா, அசிட்டோபேக்டர், அஸ்சோஸ்பைரில்லம், சூடோமோனாஸ் போன்ற உயிர் உரங்கள் மூலம் மண்புழு உரத்தினை ஊட்டமேற்றலாம். இதன்மூலம் பயிர்களுக்குத் தேவையான சத்துகள் அனைத்தும் அதிகரிக்கின்றன.\n" +
                "☘முக்கியமாக கவனிக்க வேண்டியவை இந்த உரத்தை பயிர்களுக்கு இட்டவுடன் மண் அணைத்து உடனடியாக தண்ணீர் பாச்ச வேண்டும்.மண்புழு உரம் சூரிய ஒளியில் பட்டால் இதில் உள்ள நுண்ணுயிர்கள் அழிந்துவிடும். அதனால் கண்டிப்பாக எல்லாப் பயிர்களுக்கும் இட்டவுடன் தண்ணீர் பாச்ச வேண்டும்.\n";
        return array1;
    }

    public String  அமிர்தகரைசல்() {
        String array1="பச்சை பசுஞ்சாணம் -10 kg,பசுவின் கோமியம் -10லிட்,நாட்டு சர்க்கரை -250 g,தண்ணீர் -100 lit,நிலத்தினுடைய வளமான மேல் மண் ஒரு கைப்பிடி அளவு.\n" +
                "இவைகளை ஒரு சிமெண்ட் தொட்டியில் போட்டுக் கலக்கி ஒரு நாள் வைத்திருந்தால் அடுத்த நாளே இந்த கரைசல் தயாராகி விடும்.இதை 10% கரைசலாக பாசன நீருடன் கலந்து விடலாம்.அல்லது தெளிப்பு உரமாகவும் பயன்படுத்தலாம்.பாசன நீருடன் கலந்து விட ஏக்கருக்கு 50லிட்டர் தேவைப்படும்.தெளிப்பு உரமாகவும் பயன்படுத்த 10லிட்டர் போதும்.இது மண்ணின் வளம் மற்றும் நலத்தையும் கூட்டி பயிர்கள அனைத்திற்கும் நன்மை பயக்கும்.";
        return array1;
    }
    public String  வீட்டில்இயற்கைஉரம்தயாரித்தல்() {
        String array1="ஒரு பிளாஸ்டிக் வாளி அல்லது தொட்டி (மண், சிமிண்ட், பிளாஸ்டிக்) எடுத்துக் கொள்ளவும். அதன் அடியில் சிறு துவாரங்கள் இட வேண்டும். துவாரமானது காற்றோட்டத்திற்கும் அதிகப்படியான தண்ணீர் வெளியேறுவதற்கும் உதவும்.\n" +
                "பின் அதில் ஒரு இஞ்ச் உயரத்திற்கு சிறு சிறு கற்களை பரப்பவும். அதன் மீது ஒரு இஞ்ச் உயரத்திற்கு மணலைப் பரப்பவும். அதன் மீது ஒரு இன்ச் உயரத்திற்கு அந்தப் பகுதியில் கிடைக்கும் மண்ணைப் பரப்பவும்.\n" +
                "அதன் மீது தினமும் சேரும் சமையலறைக் கழிவுகள், காய்ந்த இலை சருகுகள், கிழிந்த தாள்கள் (தாள்களை தண்ணீரில் நனைத்து தொட்டியில் போடவும்) ஆகியவற்றைச் சேர்க்கவும். ஆரம்பத்தில் அசைவக் கழிவுகளைத் தவிர்க்கவும்.\n" +
                "அவற்றில் ஈரப்பதம் இருக்குமாறு பார்த்துக் கொள்ளவும். ஈரப்பதம் அதிகம் இருந்தால் கழிவோடு சற்று மண்ணைச் சேர்க்கவும். தொட்டி நிறையும் வரை கழிவுகளைச் சேர்த்து வரவும்.தொட்டி நிறைந்தவுடன் தொட்டியை மூடிவிடவும். மூடியின் மீது சிறு துவாரம் இடவும்.\n" +
                "வாரம் ஒருமுறை கழிவுகளை கிளறி விடவும். கழிவுகள் மட்குவதற்கு 30 நாட்களிலிருந்து 60 நாட்கள் வரை ஆகும். நன்கு மக்கிய கழிவுகளிலிருந்து மண்வாசனை வரும். இயற்கை உரம் தயார். இது கருமையான நிறத்தில் இருக்கும்";
        return array1;
    }
    public String  தோட்டத்தில்எருதயாரித்தல்() {
        String array1="முதலில் எரு தயாரிக்க மூட்டத்தின் அடிப்பகுதியில் சிறு கம்பு மற்றும் குச்சிகளைப் பயன்படுத்தவும். இது காற்றோட்டத்திற்கு உதவும். இதன் மீது புல், இலை தழைகள் சருகுகள், பழக்காய்கறிக் கழிவுகள் முட்டை மற்றும் விரைவில் மக்கிப் போகும் பொருட்களைப் பயன்படுத்தவும்.\n" +
                "பெரியனவாக இருக்கும் பொருட்களை பொடியாக நறுக்கிச் சேர்க்கவும். புதிய சாணத்தைக் கரைத்து மூட்டத்தின் மீது தெளிக்கவும். மூட்டத்தின் உயரம் 3 அடிக்குக் குறையாமலும் 5 அடிக்கு மேற்போகாமலும் இருக்க வேண்டும்.\n" +
                "மூட்டத்தின் ஈரத்தன்மையைத் தக்க வைத்துக் கொள்ள அதனைப் பிளாஸ்டிக்கால் மூடவும். ஐந்து நாட்களுக்கு ஒரு முறை இந்த மூட்டத்தில் தண்ணீர் தெளிக்கவும். மூட்டத்தை 10 நாட்களுக்கு ஒரு முறை கிளறி விடவும். 45லிருந்து 60 நாட்களுக்குப் பிறகு இயற்கையான எரு தயாராக இருக்கும். தயார் நிலையிலுள்ள எருவில் மண்வாசனை வரும்.";
        return array1;
    }

}
