package com.example.nanda.newagri.Agriculture;

import android.content.Context;
import android.content.Intent;
import android.net.Uri;
import android.os.Bundle;
import android.support.v4.app.Fragment;
import android.support.v7.widget.CardView;
import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;

import com.example.nanda.newagri.R;



public class NewsFeed extends Fragment {
    CardView nf1,nf2,nf3;
    String news1="கிருஷ்ணகிரி மாவட்டத்தில் அரசு மானியத்துடன் தீவனப் பயிர் சாகுபடி திட்டங்கள் செயல்படுத்தப்படவுள்ளதாக மாவட்ட ஆட்சியர் சி.கதிரவன் தெரிவித்தார்.\n" +
            " இதுகுறித்து அவர் வெளியிட்ட செய்திக் குறிப்பு:\n" +
            " கால்நடைகளுக்கான தீவன பற்றாக்குறையை நிவர்த்தி செய்யும் வகையில் கால்நடை வளர்ப்போர் பசுந்தீவனத்தை உற்பத்தி செய்வதை ஊக்கப்படுத்த அரசு கடந்த 5 ஆண்டுகளாக மாநில தீவன அபிவிருத்தித் திட்டத்தைச் செயல்படுத்தி வருகிறது.\n" +
            " நடப்பு நிதியாண்டில் அரசு மானியத்துடன் கூடிய தீவனப்பயிர் சாகுபடி திட்டங்களைச் செயல்படுத்தவுள்ளது. அதன்படி, கம்பு, நேப்பியா தீவனப்பயிர் 0.25 ஏக்கர் பரப்பில் சாகுபடி செய்ய தீவனப்புல் கரணைகள் வழங்கும் திட்டம். மானாவரியில் 0.25 ஏக்கர் பரப்பில் தீவனச் சோளம் மற்றும் தீவனத் தட்டைப்பயறு சாகுடி செய்ய தீவன விதைகள் வழங்குதல், முற்போக்கு விவசாயிகள் மூலம் சான்றிதழ் பெற்ற தீவனச்சோளம் மற்றும் தீவன தட்டைப்பயிறு விதைகளை உற்பத்தி செய்வதற்கு தீவன விதைகள் இலவசமாக வழங்கப்படும்.\n" +
            " கால்நடைகள் வளர்ப்போரிடையே நவீன தீவன உற்பத்தி முறைகள் குறித்து ஒருநாள் பயிற்சி, ஒசூர் மாவட்ட கால்நடைப் பண்ணையில் வழங்கப்படும். தீவனப் பயிர் அதிக அளவில் கிடைக்கும் காலங்களில் அவற்றை சேகரித்து கால்நடைகளுக்கு தீவனப் பற்றாகுறைக் காலங்களில் வழங்குவதற்கேற்ப ஒரு பயனாளிக்கு ஊறுகாய் புல் தயாரிக்கும் பொருட்டு 250 கிலோ கொள்ளளவு உடைய 4 சைலேஜ் பைகள் இலவசமாக வழங்கப்படும்.\n" +
            " மின்சாரத்தால் இயங்கும் புல் நறுக்கும் கருவிகள் நிறுவுவதற்கு விவசாயிகளுக்கு 60 சத மானியம் வழங்குதல். அசோலாத் திட்டல் அமைக்க ஒவ்வொரு பயனாளிக்கும் அதிகபட்சம் 2 அசோலா அலகுகள் வழங்குதல். மர வகை தீவனத்தின் முக்கியத்துவத்தை உணர்த்த கல்யாண முருங்கை, அகத்தி, சூபாபுல் போன்ற மரக்கன்றுகள் விவசாயிகளுக்கு வழங்குதல். மரவகை தீவனப்பயிர் உற்பத்தியைப் பெருக்குதல் மூலம் கோடை மற்றும் தீவனப்பற்றாக்குறை காலங்களில் தீவனம் கிடைக்க செய்தல். விலையில்லா ஆடுகள் வழங்கப்பட்ட பயனாளிகளுக்கு 10 அகத்தி மரக்கன்றுகள் இலவசமாக வழங்குதல் ஆகிய திட்டங்கள் செயல்படுத்தப்படுகின்றன.\n" +
            " இந்தத் திட்டங்களில் பயனடைய விரும்பும் விவசாயிகள் அருகில் உள்ள கால்நடை மருந்தக கால்நடை உதவி மருத்துவரை அணுகி விண்ணப்பங்களை அளித்து பயன்பெற கேட்டுக் கொள்ளப்படுகிறார்கள் என அதில் தெரிவிக்கப்பட்டுள்ளது.";
    String news2=" டெல்லி: பசுவின் சாணத்தையும், விவசாய கழிவுப் பொருட்களையும் இணையதளத்தில் விற்பனை செய்வதற்கு வசதியாக புதிய வலைதளம் உருவாக்கப்படும் என்று பிரதமர் மோடி மன் கி பாத் நிகழ்ச்சியில் தெரிவித்தார். மத்திய அரசு புதிதாக தொடங்கிய கோபர் தன் திட்டத்தின் மூலம் கிராமங்களில் பசுவின் சாணம், விவசாயக் கழிவுகள் மூலம் பயோ கியாஸ் உருவாக்கப்பட்டு வருகிறது. ஸ்வச் பாரத் திட்டத்தின் மூலம் செயல்படுத்தும் திட்டத்தின் மூலம் சுத்தமான எரி சக்தி கிடைக்கும். கோபர்-தன் திட்டம் என்பது கிராமங்களை சுத்தம் செய்வது மட்டுமல்ல, கழிவுகளை மறுசுழற்சி செய்து அவற்றின் மூலம் எப்படி உபரி வருமானம் பெறுவதும் ஆகும் என்று பிரதமர் மோடி கூறியுள்ளார். மோடியின் மன் கி பாத் பிரதமர் மோடி ஒவ்வொரு மாதமும் நாட்டு மக்களிடம் அன்றாட நிகழ்வுகளை நேரடியாக பேசம் வகையில் மன் கி பாத் (மனதின் குரல்) என்ற வானொலி நிகழ்ச்சியின் மூலம் உரை நிகழ்த்துவது வழக்கம். அதேபோல் 41வது முறையாக இன்றும் மனதின் குரல் நிகழ்ச்சியில் உரை நிகழ்த்தும்போது விவசாயக் கழிவுகள், சமையலறைக் கழிவுகளைக் கொண்டு இயற்கை எரிவாயுவை உற்பத்தி செய்ய முன்வரவேண்டும் என்று கேட்டுக்கொண்டார். \n";

    String news3="கிருஷ்ணகிரி மாவட்டத்தில் தேசிய தோட்டக்கலை இயக்கம் மூலம் பல்வேறு திட்டங்களைச் செயல்படுத்த மானியத்துடன் ரூ. 17 கோடி ஒதுக்கீடு செய்யப்பட்டுள்ளது.\n" +
            " இதுகுறித்து தோட்டக்கலை துறை சார்பில் திங்கள்கிழமை வெளியிடப்பட்ட செய்திக் குறிப்பு:\n" +
            " கிருஷ்ணகிரி மாவட்டத்தில் தோட்டக்கலை பயிர்களில் வீரிய ஒட்டுரக காய்கறிகள், மா, கொய்யா, திசுவாழை, மல்லிகை, இஞ்சி, பூண்டு, மஞ்சள் மற்றும் கிராம்பு ஆகியவற்றில் புதிய தோட்டங்கள் அமைக்க ரூ.7,99,82,000 செலவில் 415 ஹெக்டேர் பரப்பில் 40 சத மானியமும், பப்பாளி, ஆரஞ்சு மற்றும் எலுமிச்சை போன்ற பயிர்களுக்கு 50 சத மானியமும் வழங்கப்படுகிறது.\n" +
            " மேலும், உயர் தொழில்நுட்ப சாகுபடி முறைகளை உள்ளடங்கிய பாதுகாக்கப்பட்ட சாகுபடி இனத்திற்கு ரூ. 10, 98,62,000 செலவில் 2.35 லட்சம் சதுர மீட்டர் பரப்பில் பசுமைக்குடில்கள் மற்றும் நிழல்வலை குடிகள் அமைக்கவும், 50 ஹெக்டேர் பரப்பளவில் நிலப்போர்வை அமைக்க 50 சத மானியத்தில் செயல்படுத்தத் திட்டமிடப்பட்டுள்ளது.\n" +
            " பண்ணை இயந்திரங்களான மினி டிராக்டர்கள், பவர் டில்லர்கள் மற்றும் தெளிப்பான்கள் 25 முதல் 50 சத மானியம் வரை அனுமதிக்கப்பட்டு கிருஷ்ணகிரி மாவட்டத்தில் ரூ. 5 லட்சம் நிதி ஒதுக்கீடு செய்யப்பட்டுள்ளது.\n" +
            " அறுவடைக்கு பிந்தைய மேலாண்மைக்கான உள்கட்டமைப்பு வசதிகள் மேற்கொள்ள 50 சத மானியத்தில் சிப்பம் கட்டும் அறை, குறைந்த செலவின வெங்காய சேமிப்பு கிடங்கு போன்றவை செயல்படுத்தப்பட உள்ளன.\n" +
            " தோட்டக்கலை பயிர்களுக்கான சந்தை உள்கட்டமைப்பு வசதிகள் மேம்படுத்த மானியத்துடன் கூடிய ஊரக சந்தை, சில்லறை விற்பனை நிலையம் மற்றும் நடமாடும் விற்பனை நிலையம் அமைக்க விவசாயிகள் மற்றும் விவசாய உற்பத்தி குழுக்கள் வரவேற்கப்படுகின்றன. இதற்காக ரூ. 22 .75 லட்சம் நிதி ஒதுக்கீடு செய்யப்பட்டுள்ளது.\n" +
            " பண்ணை சாகுபடிக்கு தேவையான பொருள்கள் 50 சத மானியத்தில் விவசாயிகளுக்கு ரூ. 2 ஆயிரத்திற்கும் மிகாமல் ரூ. 32.32 லட்சம் நிதி ஒதுக்கீட்டில் 1,600 விவசாயிகளுக்கு வழங்க திட்டமிடப்பட்டுள்ளது.\n" +
            " உயர் தொழில்நுட்ப சாகுபடி முறைகளில் விவசாயிகளுக்கு பயிற்சி அளிக்க ரூ.8.20 லட்சம் நிதி ஒதுக்கீடு செய்யப்பட்டுள்ளது. மேலும் 40 சத மானியத்தில் தேனீ வளர்ப்பு, 50 சத மானியத்தில் பழைய தோட்டங்கள் புனரமைத்தல், மண்புழு உரம் உற்பத்தி மற்றும் மண்புழு உர படுக்கை அமைப்பதற்கு ரூ. 3.30 லட்சமும், தோட்டக்கலை பயிர்களுக்காக 30 சத மானியத்தில் ஹெக்டேருக்கு ரூ. 500-க்கும் மிகாமல் நுண்ணூட்ட கலவை விநியோகம் செய்ய ரூ.1.50 லட்சம் நிதி ஒதுக்கீடு செய்யப்பட்டுள்ளது.\n" +
            " இவ்வாறு கிருஷ்ணகிரி மாவட்டத்தில் தோட்டக்கலை மற்றும் மலைப்பயிர் துறை மூலம் தேசிய தோட்டக்கலை இயக்கம் விவசாயிகள் பயன் பெறும் வகையில் மானியத்துடன் கூடிய பல்வேறு திட்டங்களுக்காக ரூ.17 கோடி மதிப்பில் செயல்படுத்தப்பட உள்ள நிலையில் இந்த வாய்ப்பை விவசாயிகள் பயன்படுத்திக் கொள்ள வேண்டும் என அதில் தெரிவிக்கபபட்டுள்ளது.\n";
    public NewsFeed() {
}
    @Override
    public View onCreateView(LayoutInflater inflater, ViewGroup container, Bundle savedInstanceState) {
        View view=inflater.inflate(R.layout.fragment_news_feed, container, false);
        nf1=(CardView)view.findViewById(R.id.nf1);
        nf2=(CardView)view.findViewById(R.id.nf2);
        nf3=(CardView)view.findViewById(R.id.nf3);
        nf1.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
            Intent i=new Intent(getActivity(),newsActivity.class);
            i.putExtra("news",news1);
            startActivity(i);
            }
        });
        nf2.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent i=new Intent(getActivity(),newsActivity.class);
                i.putExtra("news",news2);
                startActivity(i);
            }
        });
        nf3.setOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                Intent i=new Intent(getActivity(),newsActivity.class);
                i.putExtra("news",news3);
                startActivity(i);
            }
        });


        return view;

    }
}